coocox/Mplib/Toshaba/TMPM33x/TMPM332/cmsis_lib/lib/include/tmpm332_gpio.h
#define IS_GPIO_OPEN_DRAIN(param)       (((param) == GPIO_PE)|| \
                                         ((param) == GPIO_PF)|| \
                                         ((param) == GPIO_PG))

#define IS_GPIO_FUNCTION(param)         (((param) == GPIO_PA)|| \
                                         ((param) == GPIO_PB)|| \
                                         ((param) == GPIO_PD)|| \
                                         ((param) == GPIO_PE)|| \
                                         ((param) == GPIO_PF)|| \
                                         ((param) == GPIO_PG)|| \
                                         ((param) == GPIO_PH)|| \
                                         ((param) == GPIO_PI)|| \
                                         ((param) == GPIO_PJ)|| \
                                         ((param) == GPIO_PK))

#define IS_GPIO_PA_FUNCTION_REGISTER(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PB_FUNCTION_REGISTER(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PD_FUNCTION_REGISTER(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PE_FUNCTION_REGISTER(param)  (((param) == GPIO_FUNC_REG_1) || \
                                              ((param) == GPIO_FUNC_REG_2))

#define IS_GPIO_PF_FUNCTION_REGISTER(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PG_FUNCTION_REGISTER(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PH_FUNCTION_REGISTER(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PI_FUNCTION_REGISTER(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PJ_FUNCTION_REGISTER(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PK_FUNCTION_REGISTER(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                              ((param) == GPIO_FUNC_REG_2))
/** @} */
/* End of group GPIO_Parameter_Definition */

/** @defgroup GPIO_Bit_Define 
  * @{
  */
#define GPIO_BIT_VALUE_1                ((uint8_t)0x01)
#define GPIO_BIT_VALUE_0                ((uint8_t)0x00)

#define IS_GPIO_BIT_VALUE(BitValue)     (((BitValue) == GPIO_BIT_VALUE_1)|| \
                                         ((BitValue) == GPIO_BIT_VALUE_0))

#define GPIO_BIT_0                      ((uint8_t)0x01)
#define GPIO_BIT_1                      ((uint8_t)0x02)
#define GPIO_BIT_2                      ((uint8_t)0x04)
#define GPIO_BIT_3                      ((uint8_t)0x08)
#define GPIO_BIT_4                      ((uint8_t)0x10)
#define GPIO_BIT_5                      ((uint8_t)0x20)
#define GPIO_BIT_6                      ((uint8_t)0x40)
#define GPIO_BIT_7                      ((uint8_t)0x80)
#define GPIO_BIT_ALL                    ((uint8_t)0xFF)

#define GPIO_PA_OUTPUT_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PA_PULLUP_BIT_ALL                   ((uint8_t)0x0D)
#define GPIO_PA_PULLDOWN_BIT_ALL                 ((uint8_t)0x02)
#define GPIO_PA_INPUT_BIT_ALL                    ((uint8_t)0x0F)

#define GPIO_PB_OUTPUT_BIT_ALL                   ((uint8_t)0x01)
#define GPIO_PB_PULLUP_BIT_ALL                   ((uint8_t)0x01)
#define GPIO_PB_INPUT_BIT_ALL                    ((uint8_t)0x01)

#define GPIO_PD_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PD_INPUT_BIT_ALL                    ((uint8_t)0xFF)

#define GPIO_PE_OUTPUT_BIT_ALL                   ((uint8_t)0x7F)
#define GPIO_PE_PULLUP_BIT_ALL                   ((uint8_t)0x7F)
#define GPIO_PE_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x7F)
#define GPIO_PE_INPUT_BIT_ALL                    ((uint8_t)0x7F)

#define GPIO_PF_OUTPUT_BIT_ALL                   ((uint8_t)0x70)
#define GPIO_PF_PULLUP_BIT_ALL                   ((uint8_t)0x70)
#define GPIO_PF_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x70)
#define GPIO_PF_INPUT_BIT_ALL                    ((uint8_t)0x70)

#define GPIO_PG_OUTPUT_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PG_PULLUP_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PG_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x0F)
#define GPIO_PG_INPUT_BIT_ALL                    ((uint8_t)0x0F)

#define GPIO_PH_OUTPUT_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PH_PULLUP_BIT_ALL                   ((uint8_t)0x0F)
#define GPIO_PH_INPUT_BIT_ALL                    ((uint8_t)0x0F)

#define GPIO_PI_OUTPUT_BIT_ALL                   ((uint8_t)0x3F)
#define GPIO_PI_PULLUP_BIT_ALL                   ((uint8_t)0x3F)
#define GPIO_PI_INPUT_BIT_ALL                    ((uint8_t)0x3F)

#define GPIO_PJ_OUTPUT_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PJ_PULLUP_BIT_ALL                   ((uint8_t)0x1F)
#define GPIO_PJ_INPUT_BIT_ALL                    ((uint8_t)0x1F)

#define GPIO_PK_OUTPUT_BIT_ALL                   ((uint8_t)0x03)
#define GPIO_PK_PULLUP_BIT_ALL                   ((uint8_t)0x02)
#define GPIO_PK_INPUT_BIT_ALL                    ((uint8_t)0x03)

#define IS_GPIO_DATA_BIT(param)         (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7)|| \
                                         ((param) == GPIO_BIT_ALL))

#define IS_GPIO_PA_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3))

#define IS_GPIO_PA_OUTPUT_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_PA_OUTPUT_BIT_ALL))

#define IS_GPIO_PA_FR1_BIT(param)       (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3))

#define IS_GPIO_PA_PULLUP_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_PA_PULLUP_BIT_ALL))

#define IS_GPIO_PA_PULLDOWN_BIT(param)  (((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_PA_PULLDOWN_BIT_ALL))

#define IS_GPIO_PA_INPUT_BIT(param)     (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_PA_INPUT_BIT_ALL))

#define IS_GPIO_PB_DATA_BIT(param)      (((param) == GPIO_BIT_0))

#define IS_GPIO_PB_OUTPUT_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_PB_OUTPUT_BIT_ALL))

#define IS_GPIO_PB_FR1_BIT(param)       (((param) == GPIO_BIT_0))

#define IS_GPIO_PB_PULLUP_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_PB_PULLUP_BIT_ALL))

#define IS_GPIO_PB_INPUT_BIT(param)     (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_PB_INPUT_BIT_ALL))

